performance/artilleryRaceRegistration.yml
config:
  target: "http://192.168.49.2:32350"
  phases:
    - duration: 30
      arrivalRate: 1    
      maxVusers: 30  
      name: Warm up

    - duration: 30
      arrivalRate: 500
      maxVusers: 40000
      name: Massive load

 #   - duration: 30
 #     arrivalRate: 10     
 #     name: Load down  

  http:
    timeout: 35

  payload:

    path: "applicationId.csv"
    fields:
        - "applicationCode"

scenarios:
  - name: "Register in Race by Order"
    flow:
      - post:
          url: "/api/tracks/byorder"
          json:
            applicationCode: "{{ applicationCode }}"
     #     capture:
     #       - json: "$.results.id"
     #         as: "trackId"