performance/artilleryRaceRegistration.yml
config:
  target: "http://192.168.49.2:31522"
  phases:
    - duration: 30
      arrivalRate: 10      
      name: Warm up

    - duration: 60
      arrivalRate: 1000
      maxVusers: 30000
      name: Sustained load

    - duration: 30
      arrivalRate: 10     
      name: Load down  

  payload:

    path: "applicationId.csv"
    fields:
        - "applicationCode"

scenarios:
  - name: "Register in Race by Order"
    flow:
      - post:
          url: "/api/tracks/byorder"
          json:
            applicationCode: "{{ applicationCode }}"
          capture:
            - json: "$.results.id"
              as: "trackId"